#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖Success! The configuration is valid.


#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

random_id.random: Refreshing state... [id=Do8Uvg]
google_service_account.org_policy_compare_sa: Refreshing state... [id=projects/orgpolicy-notifier/serviceAccounts/org-policy-compare@orgpolicy-notifier.iam.gserviceaccount.com]
google_organization_iam_custom_role.org_policy_compare_custom_role: Refreshing state... [id=organizations/948721840059/roles/org_policy_compare_cfn]
module.pubsub_scheduled_example.module.main.null_resource.dependent_files: Refreshing state... [id=6366462742101406435]
module.pubsub_scheduled_example.module.main.data.null_data_source.wait_for_files: Refreshing state...
module.pubsub_scheduled_example.module.main.data.archive_file.main: Refreshing state...
google_storage_bucket.policy_bucket: Refreshing state... [id=orgpolicy-notifier-policy-bucket-0e8f14be]
module.pubsub_scheduled_example.module.pubsub_topic.google_pubsub_topic.topic[0]: Refreshing state... [id=projects/orgpolicy-notifier/topics/orgpolicy-notifier-topic]
module.pubsub_scheduled_example.module.main.google_storage_bucket.main: Refreshing state... [id=orgpolicy-notifier-cfn-bucket-0e8f14be]
module.pubsub_scheduled_example.module.main.google_storage_bucket_object.main: Refreshing state... [id=orgpolicy-notifier-cfn-bucket-0e8f14be-c41768c2df0cbfbc046d10c3ca8f3ebc-src.zip]
google_organization_iam_member.org_policy_compare_member: Refreshing state... [id=948721840059/organizations/948721840059/roles/org_policy_compare_cfn/serviceaccount:org-policy-compare@orgpolicy-notifier.iam.gserviceaccount.com]
module.pubsub_scheduled_example.module.main.google_cloudfunctions_function.main: Refreshing state... [id=orgpolicy-notifier/us-central1/orgpolicy-notifier-0e8f14be]
module.pubsub_scheduled_example.google_cloud_scheduler_job.job[0]: Refreshing state... [id=orgpolicy-notifier-job-0e8f14be]

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.pubsub_scheduled_example.module.main.google_cloudfunctions_function.main will be updated in-place
  ~ resource "google_cloudfunctions_function" "main" {
        available_memory_mb   = 2048
        description           = "Compares Org Policies and alerts users."
        entry_point           = "announce_kickoff"
        environment_variables = {
            "ACCESS_TOKEN_NAME"        = "twitter_access_token"
            "ACCESS_TOKEN_SECRET_NAME" = "twitter_access_secret"
            "CONSUMER_KEY_NAME"        = "twitter_api_key"
            "CONSUMER_KEY_SECRET_NAME" = "twitter_api_secret"
            "FILE_LOCATION"            = "/tmp/policies.txt"
            "ORG_ID"                   = "948721840059"
            "POLICY_BUCKET"            = "orgpolicy-notifier-policy-bucket-0e8f14be"
            "POLICY_FILE"              = "policies.txt"
            "S_PROJECT"                = "orgpolicy-notifier"
            "S_SLACK_NAME"             = "slack_webhook"
            "S_TOKEN_NAME"             = "github_token"
            "S_VERSION"                = "latest"
        }
        id                    = "orgpolicy-notifier/us-central1/orgpolicy-notifier-0e8f14be"
        labels                = {}
        max_instances         = 0
        name                  = "orgpolicy-notifier-0e8f14be"
        project               = "orgpolicy-notifier"
        region                = "us-central1"
        runtime               = "python37"
        service_account_email = "org-policy-compare@orgpolicy-notifier.iam.gserviceaccount.com"
        source_archive_bucket = "orgpolicy-notifier-cfn-bucket-0e8f14be"
      ~ source_archive_object = "c41768c2df0cbfbc046d10c3ca8f3ebc-src.zip" -> "2b5b9d05584d0e305870476ad2d1f7df-src.zip"
        timeout               = 60

        event_trigger {
            event_type = "google.pubsub.topic.publish"
            resource   = "projects/orgpolicy-notifier/topics/orgpolicy-notifier-topic"

            failure_policy {
                retry = false
            }
        }
    }

  # module.pubsub_scheduled_example.module.main.google_storage_bucket_object.main must be replaced
-/+ resource "google_storage_bucket_object" "main" {
        bucket              = "orgpolicy-notifier-cfn-bucket-0e8f14be"
        content_disposition = "attachment"
        content_encoding    = "gzip"
        content_type        = "application/zip"
      ~ crc32c              = "zRE2DA==" -> (known after apply)
      ~ detect_md5hash      = "xBdowt8Mv7wEbRDDyo8+vA==" -> "different hash" # forces replacement
      ~ id                  = "orgpolicy-notifier-cfn-bucket-0e8f14be-c41768c2df0cbfbc046d10c3ca8f3ebc-src.zip" -> (known after apply)
      ~ md5hash             = "xBdowt8Mv7wEbRDDyo8+vA==" -> (known after apply)
      ~ name                = "c41768c2df0cbfbc046d10c3ca8f3ebc-src.zip" -> "2b5b9d05584d0e305870476ad2d1f7df-src.zip" # forces replacement
      ~ output_name         = "c41768c2df0cbfbc046d10c3ca8f3ebc-src.zip" -> (known after apply)
      ~ self_link           = "https://www.googleapis.com/storage/v1/b/orgpolicy-notifier-cfn-bucket-0e8f14be/o/c41768c2df0cbfbc046d10c3ca8f3ebc-src.zip" -> (known after apply)
        source              = "./src.zip"
      ~ storage_class       = "REGIONAL" -> (known after apply)
    }

Plan: 1 to add, 1 to change, 1 to destroy.

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.

```

</details>

*Pusher: @dgwhited, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform lint and apply`*